{
    "resume": {
        "summary": "Passionate web developer with expertise in designing and optimizing web applications and APIs, committed to delivering innovative solutions and driving business growth. Skilled in enhancing system performance, streamlining processes, and resolving technical challenges to exceed client expectations and elevate user experiences.",
        "skills": [
            {
                "category": "Programming Languages",
                "items": [
                    "JavaScript (ES6+)",
                    "Python",
                    "PHP"
                ]
            },
            {
                "category": "Frontend Technologies",
                "items": [
                    "HTML5",
                    "CSS3",
                    "React",
                    "Gatsby",
                    "GraphQL",
                    "jQuery",
                    "Bootstrap",
                    "Sass",
                    "Material UI"
                ]
            },
            {
                "category": "Backend Technologies",
                "items": [
                    "Node.js",
                    "Express",
                    "Django",
                    "Flask",
                    "RESTful APIs"
                ]
            },
            {
                "category": "Database Systems",
                "items": [
                    "MongoDB",
                    "MySQL",
                    "PostgreSQL"
                ]
            },
            {
                "category": "Version Control",
                "items": [
                    "Git",
                    "GitHub"
                ]
            },
            {
                "category": "Development Tools",
                "items": [
                    "VS Code",
                    "Postman",
                    "Insomnia",
                    "npm", 
                    "OpenAI GPT-3"
                ]
            },
            {
                "category": "Other",
                "items": [
                    "Agile Methodologies",
                    "JIRA",
                    "Confluence",
                    "Slack",
                    "WordPress"
                ]
            }
        ],
        "experience": [
            {
                "title": "Web Developer",
                "company": "Experian",
                "location": "Remote",
                "dates": "Sep 2023 - Present",
                "desc": [
                    "Develop an automated staging tool with Node.js and React that integrates real-time data synchronization with Google Drive API to increase staged article production from 8/day to 10+/hour.",
                    "Implement real-time content tracking using an API-driven app built with vanilla JavaScript that integrates with Wrike’s API via a user-friendly UI, reducing compliance violations by streamlining content management workflows.",
                    "Ensure consistent branding and user experience across the blog platform with 99.9% uptime by performing weekly theme updates and maintenance checks on the custom WordPress theme.",
                    "Develop and deploy custom landing pages from provided Figma mockups, ensuring precise design implementation that effectively engages target audiences while driving over $100k in revenue through market entry into emerging markets."
                ]
            },
            {
                "title": "Content Marketing Coordinator",
                "company": "Experian",
                "location": "Remote",
                "dates": "Nov 2022 - Sep 2023",
                "desc": [
                    "Design, test, and implement new features for internal web application platforms and APIs.",
                    "Regularly communicate with management and technical support colleagues to ensure project alignment.",
                    "Monitor, update, and modify existing code for enhanced system performance. ",
                    "Facilitate during internal system issues, leading to timely resolutions.",
                    "Identify areas for system performance and availability improvements, resulting in optimized user experiences.",
                    "Analyze user requirements and convert them into comprehensive design documents.",
                    "Make sound technical decisions that produce resilient, reliable systems.",
                    "Compile timely, comprehensive, and accurate documentation and reports as requested by stakeholders.",
                    "Maintain up-to-date knowledge of technological developments in the industry. "
                ]
            },
            {
                "title": "Resident Analyst",
                "company": "obo. Agency",
                "location": "Remote",
                "dates": "Sep 2022 - Nov 2022",
                "desc": [
                    "Designed business logic and technical specifications required to extract key data elements from B2B clients using graphical flow charts like business process mapping.",
                    "Translated user requirements into actionable digital transformation projects ranging from CRM integrations, data migrations, and custom database implementations.",
                    "Automated client sales and marketing activities by creating application templates, landing pages, and optimizing websites based on client personas and buyer journeys."
                ]
            }
        ]
    }
}