{
  "resume": {
    "summary": "Passionate web developer with expertise in designing and optimizing web applications and APIs, committed to delivering innovative solutions and driving business growth. Skilled in enhancing system performance, streamlining processes, and resolving technical challenges to exceed client expectations and elevate user experiences.",
    "skills": [
      {
        "category": "Programming Languages",
        "items": ["JavaScript (ES6+)", "Python", "PHP"]
      },
      {
        "category": "Frontend Technologies",
        "items": ["HTML5", "CSS3", "React", "Gatsby", "GraphQL", "jQuery", "Bootstrap", "Sass"]
      },
      {
        "category": "Backend Technologies",
        "items": ["Node.js", "Express", "Django", "Flask", "RESTful APIs"]
      },
      {
        "category": "Database Systems",
        "items": ["MongoDB", "MySQL", "PostgreSQL"]
      },
      {
        "category": "Version Control",
        "items": ["Git", "GitHub"]
      },
      {
        "category": "Development Tools",
        "items": ["VS Code", "Postman", "CI/CD Pipelines", "npm", "OpenAI", "Browser DevTools"]
      },
      {
        "category": "Other",
        "items": ["Agile Methodologies", "JIRA", "Confluence", "Slack", "WordPress"]
      }
    ],
    "experience": [
      {
        "title": "Front-End Engineer",
        "company": "Finance of America",
        "location": "Remote",
        "dates": "Sep 2025-Present",
        "desc": [
          "Design and ship consumer-facing features, including calculators and reusable UI components, across enterprise WordPress and PHP properties, enhancing page performance, UX consistency, and content discoverability across business units.",
          "Collaborate across product, design, SEO, and backend engineering to define requirements and deliver iterative improvements in an Agile workflow, maintaining code standards and Git-based CI/CD deployment hygiene to ensure stable releases.",
          "Implement SEO-focused, WCAG-compliant front-end patterns using HTML5, CSS/SCSS, and JavaScript while integrating REST APIs, optimizing load paths with browser DevTools, and resolving cross-browser/device edge-case issues.",
          "Contribute to design system maturity by extending modular components and pattern libraries across marketing properties, accelerating delivery velocity while improving consistency and governance across CMS environments."
        ]
      },
      {
        "title": "Web Developer",
        "company": "Experian",
        "location": "Remote",
        "dates": "Sep 2023-Sep 2025",
        "desc": [
          "Architect migration of a high-traffic blog from WordPress to a modern headless CMS leveraging React, Gatsby, and GraphQL, achieving a 20% reduction in load times and enhanced SEO performance.",
          "Collaborate with backend teams to develop scalable APIs in Node.js, enabling seamless data flow and integrating third-party tools with frontends to enhance user functionality.",
          "Mentor teammates by leading sessions on scalable code design, testing, and performance optimizations, ensuring adherence to high technical standards and improving team-wide code quality.",
          "Partner with cross-functional teams to define technical requirements and deliver high-quality, user-focused features in an Agile development environment.",
          "Debug complex frontend issues using DevTools, optimizing performance, and ensuring responsive design across distributed environments."
        ]
      },
      {
        "title": "Content Marketing Coordinator",
        "company": "Experian",
        "location": "Remote",
        "dates": "Nov 2021-Sep 2023",
        "desc": [
          "Automated workflows and optimized deployment pipelines by building a Node.js application integrated with Google APIs, reducing manual effort by 10x and accelerating delivery timelines.",
          "Streamlined content quality assurance, reducing broken links by 30% and duplicate content by 25% by building custom Python and Node.js scripts to automate site-wide integrity checks.",
          "Partnered with E-Commerce and SEO to support website functionality QA testing, and ensure pages are instrumented for proper tracking and performance analysis."
        ]
      },
      {
        "title": "Resident Analyst",
        "company": "obo. Agency",
        "location": "Remote",
        "dates": "Sep 2021-Nov 2021",
        "desc": [
          "Designed business logic and extracted key data elements from B2B client databases, enabling data-driven insights to improve customer personalization and engagement metrics.",
          "Developed automation workflows and implemented responsive landing pages and templates using HTML, CSS, and JavaScript.",
          "Improved customer engagement by transforming user requirements into digital initiatives, including responsive CRM integrations and data migrations."
        ]
      }
    ]
  }
}
